{
    "module list": [
        {
            "name": "Stage 1 Computing Placement Preparation",
            "desc": "This module is aimed at students who may be undertaking an industrial placement in the third year of their programme. It is designed to assist students in their search for a placement and in their preparation for the placement itself.",
            "code": "BPIE111",
            "year": "First",
            "optional": "false",
            "completed": "false",
            "owner": "corey-richardson"
        },
        {
            "name": "Software Engineering 1",
            "desc": "This module exposes students to the principles of software design and construction. The basics of constructing source code to solve a problem will be introduced, exposing students to common control structures alongside concepts such as types and generics. Major programming paradigms such as object orientation and functional programming are introduced. Additionally, key software development tools and methods are explored.",
            "code": "COMP1000",
            "year": "First",
            "optional": "false",
            "completed": "false",
            "owner": "corey-richardson"
        },
        {
            "name": "Computer Systems",
            "desc": "This module provides students with an underpinning knowledge of how computers work. Topics include low-level systems and representation of data, operating systems, and an introduction to subjects such as virtualisation, parallelism, state and communications. Students will learn how operating systems manage processes and scheduling, and how memory management works.",
            "code": "COMP1001",
            "year": "First",
            "optional": "false",
            "completed": "false",
            "owner": "corey-richardson"
        },
        {
            "name": "Cyber Security & Networks",
            "desc": "Modern computing relies upon networking and robust cyber security. This module provides an appreciation of their core enabling technologies, discussing how they can be applied. Key networking topics include routing and switching, as well as wireless networks. Key areas of security include underlying concepts and threats, and exploring security technologies that can be applied to enable defence in depth.",
            "code": "COMP1002",
            "year": "First",
            "optional": "false",
            "completed": "false",
            "owner": "corey-richardson"
        },
        {
            "name": "Algorithms, Data Structures and Mathematics",
            "desc": "Data structures and algorithms lie at the heart of Computer Science as they are the basis for an efficient solution of programming tasks. In this module, students will study core algorithms and data structures, as well as being given an introduction to algorithm analysis and basic Mathematics for Computer Science.",
            "code": "COMP1003",
            "year": "First",
            "optional": "false",
            "completed": "false",
            "owner": "corey-richardson"
        },
        {
            "name": "Computing Practice",
            "desc": "This module applies problem-based learning to provide students with the ability to identify problems and derive appropriate and considered solutions. A focus will be given to the early stages of the software development lifecycle to develop the skills of eliciting requirements whilst considering operational and technical trade-offs. The module will culminate in the creation of a simple yet complete software solution.",
            "code": "COMP1004",
            "year": "First",
            "optional": "false",
            "completed": "false",
            "owner": "corey-richardson"
        },
        {
            "name": "Stage 2 Computing Placement Preparation",
            "desc": "This module is aimed at students who may be undertaking an industrial placement in the third year of their programme. It is designed build on the Level 1 module (BPIE111) and to assist students in their search for a placement and in their preparation for the placement itself.",
            "code": "BPIE211",
            "year": "Second",
            "optional": "false",
            "completed": "false",
            "owner": "corey-richardson"
        },
        {
            "name": "Software Engineering 2",
            "desc": "Students’ understanding of software engineering is expanded by introducing a range of topics that instil best practice. Students will learn how to implement faster software using parallelism and consider aspects of human-computer interaction. Object-orientation and functional programming are revisited, while event-driven programming is introduced. Common design patterns used in the construction of software are introduced.",
            "code": "COMP2000",
            "year": "Second",
            "optional": "false",
            "completed": "false",
            "owner": "corey-richardson"
        },
        {
            "name": "Information Management & Retrieval",
            "desc": "This module introduces students to the fundamental concepts for graphical representation, information management, database systems and data modelling. The capture, digitisation, representation, organisation, transformation and presentation of information is explored using conceptual and physical data models.",
            "code": "COMP2001",
            "year": "Second",
            "optional": "false",
            "completed": "false",
            "owner": "corey-richardson"
        },
        {
            "name": "Artificial Intelligence",
            "desc": "This module provides students with an introduction to the principles of artificial intelligence and the methods used in that field. Topics covered include search and optimisation, knowledge representation and reasoning, and machine learning. Students will gain experience of modelling and simulation, and will apply analytical tools to evaluating results, and will consider the ethical implications of the introduction of AI.",
            "code": "COMP2002",
            "year": "Second",
            "optional": "false",
            "completed": "false",
            "owner": "corey-richardson"
        },
        {
            "name": "Computing Group Project",
            "desc": "Knowledge gained in earlier stages of the computing programmes is consolidated and integrated into a substantial project. Students work in teams, champion professional roles, design and develop a software solution for a given scenario. The project integrates and expands upon software development stages covered on the course (project management, analysis, design, construction, communication, security and/or networking).",
            "code": "COMP2003",
            "year": "Second",
            "optional": "false",
            "completed": "false",
            "owner": "corey-richardson"
        },
        {
            "name": "Software Development Tools and Practices",
            "desc": "This module explores the current state of the art in testing tools, including static and dynamic analysis tools. It explores programming environments that automate parts of program construction processes (e.g., automated builds) and continuous integration. Software verification and validation concepts are introduced along with testing types and testing fundamentals.",
            "code": "COMP2005",
            "year": "Second",
            "optional": "false",
            "completed": "false",
            "owner": "corey-richardson"
        },
        {
            "name": "Computing Related Placement",
            "desc": "An optional, but strongly recommended placement gives you professional experience and significantly enhances your CV. Placement providers include IBM, Microsoft, Goss Interactive and Vualto. A 48-week period of professional training spent as the third year of a sandwich course, undertaking an approved placement with a suitable company. This provides an opportunity for you to gain relevant industrial experience to consolidate the first two years of study and to prepare for the final year and employment after graduation. Please note this placement is optional but strongly recommended. - I have already completed a placement year at Collins Aerospace.",
            "code": "BPIE330",
            "year": "Placement",
            "optional": "true",
            "completed": "false",
            "owner": "corey-richardson"
        },
        {
            "name": "Computing Project",
            "desc": "The Computing Project provides an opportunity to tackle a major computing related problem in an approved topic area relevant to the programme of study.",
            "code": "COMP3000",
            "year": "Final",
            "optional": "false",
            "completed": "false",
            "owner": "corey-richardson"
        },
        {
            "name": "Full-Stack Development",
            "desc": "This module explores the production of dynamic web applications with a particular focus on the web environment. Key elements such as object oriented and event-based development, asynchronous client-server communication and distributed content representation are explored through practical production. The production of a working system uses dynamic web frameworks such as HTML, CSS and JavaScript/jQuery.",
            "code": "COMP3006",
            "year": "Final",
            "optional": "false",
            "completed": "false",
            "owner": "corey-richardson"
        },
        {
            "name": "HCI, Usability and Visualization",
            "desc": "This module has three main objectives. The first objective is to enhance the students understanding of the topic of Human Computer Interaction (HCI). The second is to emphasise the crucial role of user feedback in the software development life cycle. The final objective is to exemplify this grounding in HCI and usability evaluation using the application area of Information Visualization.",
            "code": "COMP3007",
            "year": "Final",
            "optional": "false",
            "completed": "false",
            "owner": "corey-richardson"
        },
        {
            "name": "Big Data Analytics",
            "desc": "The key objective of this module is to familiarise the students with the most important information technologies used in manipulating, storing and analysing big data. Students will work with semi-structured datasets and choose appropriate storage structures for them. A representative of recent non-relational trends is presented—namely, graph-oriented databases.",
            "code": "COMP3008",
            "year": "Final",
            "optional": "true",
            "completed": "false",
            "owner": "corey-richardson"
        },
        {
            "name": "Games Graphics Pipelines",
            "desc": "This module develops core programming skills for game developers, targeting specific elements of graphics pipelines; rendering, shading and optimisation for varied platforms such as AR (mobile) VR and XR platforms. The module focuses on specific skills required to develop tools/solution for emerging game technologies.",
            "code": "COMP3015",
            "year": "Final",
            "optional": "true",
            "completed": "false",
            "owner": "corey-richardson"
        },
        {
            "name": "Immersive Game Technologies",
            "desc": "This module introduces the concepts and programming techniques for high performance real-time graphics using a relevant graphical API. A bottom-up view of graphical programming is taken, excluding the use of game engines and high-level prototyping tools. Students also learn transferrable skills: programming in an un-managed environment, tools programming, programming for physical interfaces and/or sensors.",
            "code": "COMP3016",
            "year": "Final",
            "optional": "true",
            "completed": "false",
            "owner": "corey-richardson"
        },
        {
            "name": "Computing Project Management",
            "desc": "This module provides the opportunity for students to acquire a critical understanding of the management and methodological issues associated with Software Development. ",
            "code": "COMP3017",
            "year": "Final",
            "optional": "true",
            "completed": "false",
            "owner": "corey-richardson"
        }
    ]
}